app/controllers/features_controller.rb

  def index
    @features = Feature.order('created_at DESC')
---
SELECT "features".* FROM "features" ORDER BY created_at DESC

  def show
    @feature = Feature.find(params[:id])
---
SELECT "features".* FROM "features" WHERE ("features"."id" = 1) LIMIT 1

  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save
---
INSERT INTO "features" ("category", "created_at", "entry", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "url") VALUES ('Publications', '2010-11-13 06:40:33.548221', 'Zack Sims and Dennis Kwon have teamed up to bring the StartupDigest to Columbia. Subscribe to the Columbia Digest for information on local startup events.', 'image/png', '2010-9-12-startupdigest.png', 3195, '2010-11-13 06:40:33.507516', 'Columbia StartupDigest', '2010-11-13 06:40:33.548221', 'http://thestartupdigest.com/')