app/controllers/home_controller.rb

SELECT "features".* FROM "features" ORDER BY created_at DESC LIMIT 5
---
  def index
    @features = Feature.order("created_at DESC").limit(5).all