app/controllers/posts_controller.rb

  def index
    @posts =Post.paginate :page => params[:page], :order => 'post_date DESC'
---
SELECT "posts".* FROM "posts"