app/controllers/resources_controller.rb

  def show
    @resource = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE ("resources"."id" = 1) LIMIT 1

  def edit
    @resource = Resource.find(params[:id])
---
SELECT "resources".* FROM "resources" WHERE ("resources"."id" = 2) LIMIT 1

  def create
    @resource = Resource.new(params[:resource])

    respond_to do |format|
      if @resource.save
---
INSERT INTO "resources" ("created_at", "entry", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "title", "updated_at", "url") VALUES ('2010-11-13 07:35:12.938864', 'Build-A-Feed combines event calendar feeds from technology groups into one fully customizable feed. It''s pure iCal goodness. ', 'image/jpeg', 'build-a-feed.jpg', 7395, '2010-11-13 07:35:12.815429', 'Build-A-Feed', '2010-11-13 07:35:12.938864', 'http://events.adicu.com')

  def update
    @resource = Resource.find(params[:id])

    respond_to do |format|
      if @resource.update_attributes(params[:resource])
---
SELECT "resources".* FROM "resources" WHERE ("resources"."id" = 2) LIMIT 1
UPDATE "resources" SET "entry" = 'The ADI wiki is a central repository of information on development tools, resources available at and around Columbia, past ADI workshops, and the administrative workings of the initiative.', "updated_at" = '2010-11-13 07:40:29.187149' WHERE ("resources"."id" = 2)